In [44]:
import pandas as pd
from sqlalchemy import create_engine

### Store CSV into DataFrame

In [45]:
city_file = "../Resources/city_attributes.csv"
city_data_df = pd.read_csv(city_file)
city_data_df.head()

            City        Country   Latitude   Longitude
0      Vancouver         Canada  49.249660 -123.119339
1       Portland  United States  45.523449 -122.676208
2  San Francisco  United States  37.774929 -122.419418
3        Seattle  United States  47.606209 -122.332069
4    Los Angeles  United States  34.052231 -118.243683

In [46]:
humidity_file = "../Resources/humidity_pivot.csv"
humidity_data_df = pd.read_csv(humidity_file)
humidity_data_df.head()

   Year       datetime           city  humidity
0  2016  1/1/2016 0:00      Vancouver        74
1  2016  1/1/2016 0:00       Portland        47
2  2016  1/1/2016 0:00  San Francisco        69
3  2016  1/1/2016 0:00        Seattle        70
4  2016  1/1/2016 0:00    Los Angeles        17

In [51]:
 # Create a filtered dataframe from specific columns
city_mapping_cols = ['City', 'Country', 'Latitude','Longitude']
city_transformed= city_data_df[city_mapping_cols].copy()

# Rename the column headers
city_transformed = city_transformed.rename(columns={'City':'city', 'Country':'country', 'Latitude':'latitude','Longitude':'longitude'})

# city_transformed.set_index("city",inplace=True)
city_transformed.head()

            city        country   latitude   longitude
0      Vancouver         Canada  49.249660 -123.119339
1       Portland  United States  45.523449 -122.676208
2  San Francisco  United States  37.774929 -122.419418
3        Seattle  United States  47.606209 -122.332069
4    Los Angeles  United States  34.052231 -118.243683

In [53]:
 # Create a filtered dataframe from specific columns
humidity_mapping_cols = ['Year', 'datetime', 'city','humidity']
humidity_transformed= humidity_data_df[humidity_mapping_cols].copy()
# Rename the column headers
humidity_transformed = humidity_transformed.rename(columns={'Year':'year', 'datetime':'datetime', 'city':'city','humidity':'humidity'})

# humidity_transformed.set_index("humidity",inplace=True)
humidity_transformed.head()

   year       datetime           city  humidity
0  2016  1/1/2016 0:00      Vancouver        74
1  2016  1/1/2016 0:00       Portland        47
2  2016  1/1/2016 0:00  San Francisco        69
3  2016  1/1/2016 0:00        Seattle        70
4  2016  1/1/2016 0:00    Los Angeles        17

### Connect to local database

In [54]:
rds_connection_string = "postgres:postgres@localhost:5432/weather"
engine = create_engine(f'postgresql://{rds_connection_string}')

### Check for tables

In [55]:
engine.table_names()

['humidity',
 'pressure',
 'temperature',
 'description',
 'wind_direction',
 'city',
 'wind_speed']

### Use pandas to load csv converted DataFrame into database

In [57]:
city_transformed.to_sql(name='city', con=engine, if_exists='append', index=False)

In [58]:
humidity_transformed.to_sql(name='humidity', con=engine, if_exists='append', index=False)

### Confirm data has been added by querying the customer_name table
* NOTE: can also check using pgAdmin

In [59]:
pd.read_sql_query('select * from city', con=engine).head()

            city        country   latitude   longitude
0      Vancouver         Canada  49.249660 -123.119339
1       Portland  United States  45.523449 -122.676208
2  San Francisco  United States  37.774929 -122.419418
3        Seattle  United States  47.606209 -122.332069
4    Los Angeles  United States  34.052231 -118.243683

In [60]:
pd.read_sql_query('select * from humidity', con=engine).head()

   year    datetime           city  humidity
0  2016  2016-01-01      Vancouver      74.0
1  2016  2016-01-01       Portland      47.0
2  2016  2016-01-01  San Francisco      69.0
3  2016  2016-01-01        Seattle      70.0
4  2016  2016-01-01    Los Angeles      17.0